package main

// ==========================================
// 配置与常量 (Config)
// ==========================================

const (
	CookieName    = "discord_session"
	LimitFile     = "refresh.log"
	WindowSeconds = 24 * 3600
	MaxRefreshes  = 30
	Port          = "9966"
	GuildID       = "1159839373001498718" // 可选，特定判断公会ID
	ChannelID     = "1325014797057785867" // 可选，特定判断频道ID
)

// ChannelList 频道配置
var ChannelList = []struct {
	MonthStr, Title, SubTitle, FileName, PostID string
}{
	// 2025年 下半年
	{"12月", "2025年12月", "百萬Eric_王老板", "2025-12.json", "1445638241280856124"},
	{"11月", "2025年11月", "百萬Eric_王老板", "2025-11.json", "1433398128903716894"},
	{"10月", "2025年10月", "百萬Eric_王老板", "2025-10.json", "1423490495564480572"},
	{"9月", "2025年9月", "百萬Eric_王老板", "2025-09.json", "1413021500721594389"},
	{"8月", "2025年8月", "百萬Eric_王老板", "2025-08.json", "1401143021063634975"},
	{"7月", "2025年7月", "百萬Eric_王老板", "2025-07.json", "1389861377702629376"},
	// 2025年 上半年
	{"5月", "2025年5月", "百萬Eric_王老板", "2025-05.json", "1370596955968901240"},
	{"4月", "2025年4月", "百萬Eric_王老板", "2025-04.json", "1355769346667974737"},
	{"3月", "2025年3月", "百萬Eric_王老板", "2025-03.json", "1345024846194675833"},
	{"2月", "2025年2月", "百萬Eric_王老板", "2025-02.json", "1336592565876559872"},
	{"1月", "2025年1月", "百萬Eric_王老板", "2025-01.json", "1325716407458992199"},
}
